# 1.import library x data fram

In [19]:
import pandas as pd

In [20]:
import pyodbc

# 2. import data fram from SQL server

In [28]:
conn = pyodbc.connect( #CONNECTION
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=LAPTOP-OI1U6J19\MSSQLSERVER01;"
    "DATABASE=1;"
    "Trusted_Connection=yes;"
    "TrustServerCertificate=yes;")
df_associated_rule = pd.read_sql_query('''
                                        
SELECT *
FROM [1].[dbo].[1.marketing_campaign]
                                       
    ; ''', conn)
df_associated_rule

<>:3: SyntaxWarning: "\M" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\M"? A raw string is also an option.
<>:3: SyntaxWarning: "\M" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\M"? A raw string is also an option.
C:\Users\Bom's PC\AppData\Local\Temp\ipykernel_14724\1657284699.py:3: SyntaxWarning: "\M" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\M"? A raw string is also an option.
  "SERVER=LAPTOP-OI1U6J19\MSSQLSERVER01;"
C:\Users\Bom's PC\AppData\Local\Temp\ipykernel_14724\1657284699.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_associated_rule = pd.read_sql_query('''

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,6299,1968,PhD,Divorced,42564.0,0,1,2013-01-02,28,324,...,7,True,False,False,False,False,False,3,11,True
1,10846,1978,Master,Married,43783.0,1,0,2014-05-29,22,327,...,7,True,False,False,False,False,False,3,11,False
2,347,1976,Graduation,Divorced,40780.0,0,1,2012-09-08,30,229,...,9,False,False,False,False,False,False,3,11,False
3,6543,1945,Master,Together,62847.0,0,0,2013-01-15,45,521,...,2,False,False,False,False,False,False,3,11,False
4,10446,1957,PhD,Married,82017.0,0,0,2012-11-07,58,184,...,2,False,True,True,True,False,False,3,11,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,49,1970,Graduation,Single,20587.0,1,0,2014-05-11,39,2,...,7,False,False,False,False,False,False,3,11,False
2236,4290,1972,Graduation,Married,30467.0,1,0,2014-03-19,8,1,...,7,False,False,False,False,False,False,3,11,False
2237,10219,1972,Graduation,Together,31590.0,1,0,2013-06-18,40,6,...,8,False,False,False,False,False,False,3,11,False
2238,4211,1986,Basic,Married,20425.0,1,0,2012-10-29,5,4,...,7,False,False,False,False,False,False,3,11,False
2239,1135,1960,Master,Together,17144.0,1,1,2014-02-15,96,18,...,7,False,False,False,False,False,False,3,11,False

# 3. cleaning data process

## 3.1 remove duplicate row

In [ ]:
df_associated_rule = df_associated_rule.drop_duplicates()
df_associated_rule

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,6299,1968,PhD,Divorced,42564.0,0,1,2013-01-02,28,324,...,7,True,False,False,False,False,False,3,11,True
1,10846,1978,Master,Married,43783.0,1,0,2014-05-29,22,327,...,7,True,False,False,False,False,False,3,11,False
2,347,1976,Graduation,Divorced,40780.0,0,1,2012-09-08,30,229,...,9,False,False,False,False,False,False,3,11,False
3,6543,1945,Master,Together,62847.0,0,0,2013-01-15,45,521,...,2,False,False,False,False,False,False,3,11,False
4,10446,1957,PhD,Married,82017.0,0,0,2012-11-07,58,184,...,2,False,True,True,True,False,False,3,11,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,49,1970,Graduation,Single,20587.0,1,0,2014-05-11,39,2,...,7,False,False,False,False,False,False,3,11,False
2236,4290,1972,Graduation,Married,30467.0,1,0,2014-03-19,8,1,...,7,False,False,False,False,False,False,3,11,False
2237,10219,1972,Graduation,Together,31590.0,1,0,2013-06-18,40,6,...,8,False,False,False,False,False,False,3,11,False
2238,4211,1986,Basic,Married,20425.0,1,0,2012-10-29,5,4,...,7,False,False,False,False,False,False,3,11,False
2239,1135,1960,Master,Together,17144.0,1,1,2014-02-15,96,18,...,7,False,False,False,False,False,False,3,11,False

## 3.2 detect & remove outlier using IQR

In [ ]:
# --- Calculate Q1 (25th percentile) and Q3 (75th percentile) ---
Q1 = df_associated_rule['ID'].quantile(0.25)
Q3 = df_associated_rule['ID'].quantile(0.75)

# --- Calculate IQR ---
IQR = Q3 - Q1
print(f"\nQ1: {Q1}, Q3: {Q3}, IQR: {IQR}")

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df_associated_rule = df_associated_rule[(df_associated_rule['ID'] >= lower_bound) & (df_associated_rule['ID'] <= upper_bound)]

Q1: 2828.25, Q3: 8427.75, IQR: 5599.5

## 3.3 Remove Irrelevant Data Using Biz Sense (loai bo gia tri k lien quan)

df_associated_rule = df_associated_rule[['Member_number','Date','itemDescription']] #OBJECTIVES > 1 => LIST này là mẫu của thầy

In [36]:
df_associated_rule = df_associated_rule[df_associated_rule["Response"]==True]

In [37]:
df_associated_rule

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,6299,1968,PhD,Divorced,42564.0,0,1,2013-01-02,28,324,...,7,True,False,False,False,False,False,3,11,True
4,10446,1957,PhD,Married,82017.0,0,0,2012-11-07,58,184,...,2,False,True,True,True,False,False,3,11,True
17,3483,1958,Graduation,Married,48192.0,0,0,2013-04-06,76,1039,...,8,False,True,False,True,True,False,3,11,True
24,5585,1972,Graduation,Single,21359.0,1,0,2013-04-20,1,12,...,8,False,False,False,False,False,False,3,11,True
33,9493,1980,PhD,Single,76412.0,0,0,2013-05-05,15,840,...,3,False,False,True,True,False,False,3,11,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2202,4073,1954,2n Cycle,Married,63564.0,0,0,2014-01-29,0,769,...,6,True,False,False,False,False,False,3,11,True
2206,3667,1969,Graduation,Married,80952.0,0,0,2013-02-28,20,778,...,8,False,True,True,True,False,False,3,11,True
2209,4012,1972,PhD,Together,62220.0,0,1,2012-08-11,55,799,...,6,False,False,False,False,False,False,3,11,True
2216,7573,1978,PhD,Single,31626.0,1,0,2013-05-10,12,39,...,7,True,False,False,False,False,False,3,11,True
2225,8897,1965,Graduation,Single,42720.0,1,1,2013-04-24,9,392,...,8,False,False,False,False,False,False,3,11,True

## 3.4 Standardization Capitalization

In [40]:
df_associated_rule.rename(columns={
    "MntWines": "Mnt_Wines"
}, inplace=True)

C:\Users\Bom's PC\AppData\Local\Temp\ipykernel_14724\3128427266.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_associated_rule.rename(columns={

In [41]:
df_associated_rule

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,Mnt_Wines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,6299,1968,PhD,Divorced,42564.0,0,1,2013-01-02,28,324,...,7,True,False,False,False,False,False,3,11,True
4,10446,1957,PhD,Married,82017.0,0,0,2012-11-07,58,184,...,2,False,True,True,True,False,False,3,11,True
17,3483,1958,Graduation,Married,48192.0,0,0,2013-04-06,76,1039,...,8,False,True,False,True,True,False,3,11,True
24,5585,1972,Graduation,Single,21359.0,1,0,2013-04-20,1,12,...,8,False,False,False,False,False,False,3,11,True
33,9493,1980,PhD,Single,76412.0,0,0,2013-05-05,15,840,...,3,False,False,True,True,False,False,3,11,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2202,4073,1954,2n Cycle,Married,63564.0,0,0,2014-01-29,0,769,...,6,True,False,False,False,False,False,3,11,True
2206,3667,1969,Graduation,Married,80952.0,0,0,2013-02-28,20,778,...,8,False,True,True,True,False,False,3,11,True
2209,4012,1972,PhD,Together,62220.0,0,1,2012-08-11,55,799,...,6,False,False,False,False,False,False,3,11,True
2216,7573,1978,PhD,Single,31626.0,1,0,2013-05-10,12,39,...,7,True,False,False,False,False,False,3,11,True
2225,8897,1965,Graduation,Single,42720.0,1,1,2013-04-24,9,392,...,8,False,False,False,False,False,False,3,11,True

## 3.5 Convert Data type

In [48]:
df_associated_rule.info()

<class 'pandas.core.frame.DataFrame'>
Index: 334 entries, 0 to 2225
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   334 non-null    int64
 1   Year_Birth           334 non-null    int64
 2   Education            334 non-null    object
 3   Marital_Status       334 non-null    object
 4   Income               333 non-null    float64
 5   Kidhome              334 non-null    int64
 6   Teenhome             334 non-null    int64
 7   Dt_Customer          334 non-null    datetime64[ns]
 8   Recency              334 non-null    int64
 9   Mnt_Wines            334 non-null    int64
 10  MntFruits            334 non-null    int64
 11  MntMeatProducts      334 non-null    int64
 12  MntFishProducts      334 non-null    object
 13  MntSweetProducts     334 non-null    int64
 14  MntGoldProds         334 non-null    int64
 15  NumDealsPurchases    334 non-null    int64
 16  NumWebPurchases      334 non-null    int64
 17  NumCatalogPurchases  334 non-null    int64
 18  NumStorePurchases    334 non-null    int64
 19  NumWebVisitsMonth    334 non-null    int64
 20  AcceptedCmp3         334 non-null    bool
 21  AcceptedCmp4         334 non-null    bool
 22  AcceptedCmp5         334 non-null    bool
 23  AcceptedCmp1         334 non-null    bool
 24  AcceptedCmp2         334 non-null    bool
 25  Complain             334 non-null    bool
 26  Z_CostContact        334 non-null    int64
 27  Z_Revenue            334 non-null    int64
 28  Response             334 non-null    bool
dtypes: bool(7), datetime64[ns](1), float64(1), int64(17), object(3)
memory usage: 62.3+ KB

 cột Dt_customer Object

In [47]:
df_associated_rule["Dt_Customer"] = pd.to_datetime(df_associated_rule["Dt_Customer"])

C:\Users\Bom's PC\AppData\Local\Temp\ipykernel_14724\4131234930.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_associated_rule["Dt_Customer"] = pd.to_datetime(df_associated_rule["Dt_Customer"])

## 3.6 Cleaning format

## 3.7 Fix Error

## 3.8 Languagues Translation

## 3.9 Handle missing Value

In [52]:
df_associated_rule.dropna(inplace=True)

C:\Users\Bom's PC\AppData\Local\Temp\ipykernel_14724\980798460.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_associated_rule.dropna(inplace=True)

In [53]:
df_associated_rule

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,Mnt_Wines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,6299,1968,PhD,Divorced,42564.0,0,1,2013-01-02,28,324,...,7,True,False,False,False,False,False,3,11,True
4,10446,1957,PhD,Married,82017.0,0,0,2012-11-07,58,184,...,2,False,True,True,True,False,False,3,11,True
17,3483,1958,Graduation,Married,48192.0,0,0,2013-04-06,76,1039,...,8,False,True,False,True,True,False,3,11,True
24,5585,1972,Graduation,Single,21359.0,1,0,2013-04-20,1,12,...,8,False,False,False,False,False,False,3,11,True
33,9493,1980,PhD,Single,76412.0,0,0,2013-05-05,15,840,...,3,False,False,True,True,False,False,3,11,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2202,4073,1954,2n Cycle,Married,63564.0,0,0,2014-01-29,0,769,...,6,True,False,False,False,False,False,3,11,True
2206,3667,1969,Graduation,Married,80952.0,0,0,2013-02-28,20,778,...,8,False,True,True,True,False,False,3,11,True
2209,4012,1972,PhD,Together,62220.0,0,1,2012-08-11,55,799,...,6,False,False,False,False,False,False,3,11,True
2216,7573,1978,PhD,Single,31626.0,1,0,2013-05-10,12,39,...,7,True,False,False,False,False,False,3,11,True
2225,8897,1965,Graduation,Single,42720.0,1,1,2013-04-24,9,392,...,8,False,False,False,False,False,False,3,11,True

# 4. Save Clear data into database to Visualize

In [55]:
import pyodbc
conn = pyodbc.connect( #CONNECTION
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=LAPTOP-OI1U6J19\MSSQLSERVER01;"
    "DATABASE=1;"
    "Trusted_Connection=yes;"
    "TrustServerCertificate=yes;")
cursor = conn.cursor()

# --- Map pandas dtype -> SQL Server type ---
dtype_map = lambda dt: "INT" if pd.api.types.is_integer_dtype(dt) else \
                       "FLOAT" if pd.api.types.is_float_dtype(dt) else \
                       "BIT" if pd.api.types.is_bool_dtype(dt) else \
                       "DATETIME" if pd.api.types.is_datetime64_any_dtype(dt) else \
                       "VARCHAR(255)"

table_name = "marketing_campaign_clear"

# --- Drop + Create table ---
cursor.execute(f"IF OBJECT_ID('dbo.{table_name}', 'U') IS NOT NULL DROP TABLE dbo.{table_name}")
cols = ", ".join([f"[{c}] {dtype_map(df_associated_rule[c].dtype)}" for c in df_associated_rule.columns])
cursor.execute(f"CREATE TABLE dbo.{table_name} ({cols})")

# --- Insert rows ---
cursor.fast_executemany = True
cursor.executemany(f"INSERT INTO dbo.{table_name} VALUES ({','.join(['?']*len(df_associated_rule.columns))})", df_associated_rule.values.tolist())
conn.commit()

<>:4: SyntaxWarning: "\M" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\M"? A raw string is also an option.
<>:4: SyntaxWarning: "\M" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\M"? A raw string is also an option.
C:\Users\Bom's PC\AppData\Local\Temp\ipykernel_14724\1650601913.py:4: SyntaxWarning: "\M" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\M"? A raw string is also an option.
  "SERVER=LAPTOP-OI1U6J19\MSSQLSERVER01;"